backend/app/controllers/users_controller.rb

  def signup
    @user = User.create!(username: params[:username], password: params[:password], email: params[:email], image_url: params[:image_url])
    if @user.valid?
        @user.save
---
INSERT INTO "users" ("username", "password_digest", "email", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", nil], ["password_digest", "[FILTERED]"], ["email", nil], ["image_url", nil], ["created_at", "2022-10-07 02:16:41.017878"], ["updated_at", "2022-10-07 02:16:41.017878"]]
INSERT INTO "users" ("username", "password_digest", "email", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", nil], ["password_digest", "[FILTERED]"], ["email", nil], ["image_url", nil], ["created_at", "2022-10-07 02:29:21.658633"], ["updated_at", "2022-10-07 02:29:21.658633"]]