backend/app/controllers/users_controller.rb

def signup
  user = User.create!(username: params[:username], email: params[:email], password: params[:password])
---
INSERT INTO "users" ("username", "password_digest", "email", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"