backend/app/controllers/users_controller.rb

def login
  user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Marcus"], ["LIMIT", 1]]

def update
  token = request.headers["token"]
  payload = decode_token(token)[0]
  if payload
    user = User.find(payload["user_id"])
    user.image_url = params[:image_url]
    if user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "image_url" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["image_url", nil], ["updated_at", "2022-10-07 17:55:32.098390"], ["id", 1]]

def profile
  token = request.headers["token"]
  payload = decode_token(token)[0]
  if payload
    render json: User.find(payload["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def signup
  user = User.create!(username: params[:username], email: params[:email], password: params[:password], image_url: params[:image_url])
---
INSERT INTO "users" ("username", "password_digest", "email", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def set_user
    token = request.headers["token"]
    user_id = decode_token(token)
    @user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]